Table of Contents
 Class LoadGroup
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load group
public abstract class LoadGroup : OpenElementId
Inheritance
object
OpenObject
OpenElementId
LoadGroup
Derived
LoadGroupEC
LoadGroupSIA
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Dzeta
ζ
public double Dzeta { get; set; }
Property Value
double
 GammaGInf
γ G,Inf
public double GammaGInf { get; set; }
Property Value
double
 GammaGSup
γ G,Sup
public double GammaGSup { get; set; }
Property Value
double
 GammaQ
γ Q
public double GammaQ { get; set; }
Property Value
double
 GroupType
Group type
public LoadGroupType GroupType { get; set; }
Property Value
LoadGroupType
 Name
Name of load group
public string Name { get; set; }
Property Value
string
 Relation
Relation
public Relation Relation { get; set; }
Property Value
Relation
 Edit this page